ServiceInteractions/riv/clinicalprocess/requestworkflow/trunk/samples/cosmic/COSMICRequestOutcome1.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header>
        <ns1:LogicalAddress xmlns:ns1="urn:riv:itintegration:registry:1">logicalAddress</ns1:LogicalAddress>
    </env:Header>
    <env:Body>
        <ns4:ProcessRequestOutcome xmlns="urn:riv:clinicalprocess:requestworkflow:request" xmlns:ns2="AlschulerAssociates::GreenCDA" xmlns:ns3="urn:riv:clinicalprocess:requestworkflow:1" xmlns:ns4="urn:riv:clinicalprocess:requestworkflow:ProcessRequestOutcomeResponder:1">
            <ns3:requestOutcome>
                <requestId extension="test1 req id" root="1.2.752.129.2.1.2.1"/>
                <requestOutcomeId extension="SE12343-ABC:RcId:ReferralReport:820428" root="1.2.752.129.2.1.2.1"/>
                <!-- CO ?? -->
                <typeOfRequestOutcome codeSystem="1.2.752.129.2.1.2.1" code="CO"/>
                <versionTimeStamp value="20120820142559"/>
                <versionNumber>1</versionNumber>
                <patient>
                    <personId extension="201100390523" root="1.2.752.129.2.1.3.2"/>
                    <name>P1//Testp1/Test</name>
                </patient>
                <author>
                    <dateOfRequest value="20120820142300"/>
                    <staff>
                        <id extension="SE2222-EEE" root="1.2.752.129.2.1.4.1"/>
                        <name>Maria Testare</name>
                    </staff>
                    <staffOriginOrganisation>
                        <careUnitId extension="SE000123-GHJ" root="1.2.752.129.2.1.4.1"/>
                        <careUnitName>Gimo HLM</careUnitName>
                    </staffOriginOrganisation>
                    <legalAuthenticator>
                        <timeOfSigning value="20120820142300"/>
                        <signature>
                            <id extension="SE2222-EEE" root="1.2.752.129.2.1.4.1"/>
                            <name>Maria Testare</name>
                        </signature>
                    </legalAuthenticator>
                </author>
                <recipient>
                    <organisation>
                        <careUnitId extension="SE2925-TYU" root="1.2.752.129.2.1.4.1"/>
                        <careUnitName>Kirurgi/KIR Enköping-T</careUnitName>
                    </organisation>
                </recipient>
                <outcome>
                    <text>

                        Utlåtande
                        Patienten är rätt sjuk

                        Diagnos
                        test diagnosis	

                        Blodtryck
                        158/147 mmHg	

                        Utförda åtgärder
                        En mängd undersökningar 
                    </text>
                </outcome>
            </ns3:requestOutcome>
        </ns4:ProcessRequestOutcome>
    </env:Body>
</env:Envelope>
